Revit 2024 API
BuiltInFailures.RebarCouplerFailures.CouplerTypeInvalid Property
 This coupler type does not fit on the selected bar(s). Post error to delete the coupler.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CouplerTypeInvalid { get; }
Visual Basic
Public Shared ReadOnly Property CouplerTypeInvalid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CouplerTypeInvalid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace